Тест/Тест/src/Catalogs/ОбъектыАренды/ОбъектыАренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыАренды</name>
  <attributes>
    <name>Площадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЗаМетр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Отделы</name>
    <attributes>
      <name>Отдел</name>
      <type>
        <types>CatalogRef.ВидыРасходов_3</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗанимаяПлощадь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест/Тест/src/InformationRegisters/АрендаСтавка/АрендаСтавка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АрендаСтавка</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>СтавкаМетр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбщаяПлощадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/InformationRegisters/АрендаПлощадьОтдела/АрендаПлощадьОтдела.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АрендаПлощадьОтдела</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ИспользуемаяПлощадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъектАренды</name>
    <type>
      <types>CatalogRef.ОбъектыАренды</types>
    </type>
  </resources>
  <dimensions>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/Catalogs/ОбъектыАренды/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Площадь) и ЗначениеЗаполнено(СтавкаЗаМетр) Тогда 
		
		МенеджерЗаписи = РегистрыСведений.АрендаСтавка.СоздатьМенеджерЗаписи();
	
		МенеджерЗаписи.Объект 			= Ссылка;
		МенеджерЗаписи.СтавкаМетр 		= СтавкаЗаМетр; 
		МенеджерЗаписи.ОбщаяПлощадь 	= Площадь;
		МенеджерЗаписи.Период = ТекущаяДатаСеанса(); 
		
		МенеджерЗаписи.Записать();
	
	КонецЕсли; 

	Для Каждого Строка ИЗ Отделы Цикл
		Если ЗначениеЗаполнено(Строка.Отдел) и ЗначениеЗаполнено(Строка.ЗанимаяПлощадь) Тогда 
			
			МенеджерЗаписи = РегистрыСведений.АрендаПлощадьОтдела.СоздатьМенеджерЗаписи();
		
			МенеджерЗаписи.Отдел 				= Строка.Отдел;
			МенеджерЗаписи.ИспользуемаяПлощадь 	= Строка.ЗанимаяПлощадь;
			МенеджерЗаписи.ОбъектАренды 		= Ссылка; 
			
			МенеджерЗаписи.Период = ТекущаяДатаСеанса() + 1; 
			МенеджерЗаписи.Записать();
		
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры
